-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 26, 2026 at 10:29 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dal`
--

-- --------------------------------------------------------

--
-- Table structure for table `administrative_procedures`
--

CREATE TABLE `administrative_procedures` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `administrative_procedures`
--

INSERT INTO `administrative_procedures` (`id`, `name`) VALUES
(5, 'CFM'),
(6, 'TS'),
(7, 'TS1'),
(8, 'إعانة'),
(2, 'إعلان'),
(4, 'دراسة'),
(1, 'دفتر'),
(9, 'فتح'),
(10, 'مؤجلة'),
(11, 'مرفوضة'),
(3, 'منح');

-- --------------------------------------------------------

--
-- Table structure for table `communes`
--

CREATE TABLE `communes` (
  `id` int(11) NOT NULL,
  `daira_id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `communes`
--

INSERT INTO `communes` (`id`, `daira_id`, `name`) VALUES
(1, 1, 'بوسعادة'),
(2, 1, 'ولتام'),
(3, 1, 'الهامل'),
(4, 2, 'عين الملح'),
(5, 2, 'سيدي امحمد'),
(6, 2, 'بئر الفضة'),
(7, 2, 'عين فارس'),
(8, 2, 'عين الريش'),
(9, 3, 'بن سرور'),
(10, 3, 'اولاد سليمان'),
(11, 3, 'محمد بوضياف'),
(12, 3, 'الزرزور'),
(13, 4, 'امجدل'),
(14, 4, 'مناعة'),
(15, 5, 'اولاد سيدي ابراهيم'),
(16, 5, 'بن زوه'),
(17, 6, 'جبل امساعد'),
(18, 6, 'سليم'),
(20, 7, 'الحوامد'),
(21, 8, 'سيدي عامر'),
(22, 8, 'تامسة'),
(23, 7, 'الخبانة'),
(24, 7, 'امسيف');

-- --------------------------------------------------------

--
-- Table structure for table `dairas`
--

CREATE TABLE `dairas` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `dairas`
--

INSERT INTO `dairas` (`id`, `name`) VALUES
(5, 'أولاد سيدي ابراهيم'),
(7, 'الخبانة'),
(4, 'امجدل'),
(3, 'بن سرور'),
(1, 'بوسعادة'),
(6, 'جبل امساعد'),
(8, 'سيدي عامر'),
(2, 'عين الملح');

-- --------------------------------------------------------

--
-- Table structure for table `domains`
--

CREATE TABLE `domains` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `domains`
--

INSERT INTO `domains` (`id`, `name`) VALUES
(6, 'الانارة العمومية'),
(9, 'البريد والمواصلات'),
(8, 'التربية'),
(3, 'التزود بالمياه الصالحة للشرب'),
(2, 'التطهير'),
(4, 'الشباب والرياضة'),
(7, 'الصحة'),
(1, 'تهيئة حضرية'),
(5, 'طرق ومسالك');

-- --------------------------------------------------------

--
-- Table structure for table `lots`
--

CREATE TABLE `lots` (
  `id` int(11) NOT NULL,
  `project_id` int(11) NOT NULL,
  `lot_number` int(11) NOT NULL,
  `lot_name` varchar(255) DEFAULT NULL,
  `lot_budget` decimal(18,2) DEFAULT 0.00,
  `registered_amount` decimal(18,2) DEFAULT 0.00,
  `consumed_amount` decimal(18,2) DEFAULT 0.00,
  `contractor` varchar(255) DEFAULT NULL,
  `execution_duration` int(11) DEFAULT NULL,
  `start_date` date DEFAULT NULL,
  `physical_progress` decimal(5,2) DEFAULT 0.00,
  `administrative_procedure_id` int(11) DEFAULT NULL,
  `special_status1_id` int(11) DEFAULT NULL,
  `special_status2_id` int(11) DEFAULT NULL,
  `special_status3_id` int(11) DEFAULT NULL,
  `project_status_id` int(11) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `updated_by` int(11) DEFAULT NULL,
  `FlagsId` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `lots`
--

INSERT INTO `lots` (`id`, `project_id`, `lot_number`, `lot_name`, `lot_budget`, `registered_amount`, `consumed_amount`, `contractor`, `execution_duration`, `start_date`, `physical_progress`, `administrative_procedure_id`, `special_status1_id`, `special_status2_id`, `special_status3_id`, `project_status_id`, `notes`, `created_at`, `updated_at`, `updated_by`, `FlagsId`) VALUES
(1, 1, 1, NULL, '40000000.00', '39830000.00', '0.00', 'حشروف للبناء', 105, '2026-06-08', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(2, 2, 1, NULL, '12000000.00', '9043000.00', '0.00', 'دحيري مصطفى', 150, '2026-06-08', '80.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(3, 3, 1, NULL, '10000000.00', '9271000.00', '0.00', 'دحيري مصطفى', 120, NULL, '0.00', 8, 3, 1, NULL, 2, 'تم اعادة الاجراءات بسبب التنازل من طرف المقاولة - تم المنح المؤقت.', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(4, 4, 1, NULL, '11000000.00', '10021000.00', '0.00', 'رحمون علي', 75, NULL, '0.00', 8, 3, 1, NULL, 2, 'على مستوى الرقابة المالية للتاشير', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(5, 5, 1, '', '30000000.00', '33973000.00', '0.00', 'والي ايوب', 90, '2026-06-08', '55.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 20:07:34', 1, 0),
(6, 6, 1, '', '20000000.00', '20098000.00', '0.00', 'بسيطة بوضياف', 50, '2026-06-08', '40.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 20:07:37', 1, 0),
(7, 7, 1, '', '50000000.00', '44024000.00', '0.00', 'والي حكيم', 120, '2026-07-08', '0.00', 8, 1, 1, NULL, 3, 'الاشغال جارية- في انتظار رخصة جلب حصى الوادي', '2026-07-23 20:43:01', '2026-07-26 20:07:32', 1, 0),
(8, 8, 1, '', '0.00', '23600000.00', '0.00', NULL, NULL, NULL, '0.00', 1, NULL, 2, NULL, 8, 'تم الغاء العملية بامر من الوالي', '2026-07-23 20:43:01', '2026-07-26 20:19:32', 1, 1),
(9, 9, 1, NULL, '20000000.00', '20208000.00', '0.00', 'بغدادي عمار', 90, '2026-06-01', '50.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(10, 10, 1, NULL, '12000000.00', '11997000.00', '0.00', 'حشروف الطاهر', 90, NULL, '0.00', 8, 3, 1, 2, 2, 'تم تسجيل المررة التعديلية بتاريخ :07/07/2026 تم التداول لفتح الاعتماد', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(11, 11, 1, NULL, '15000000.00', '14792000.00', '0.00', 'زوليخة توفيق', 77, '2026-06-01', '70.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(12, 12, 1, NULL, '10981000.00', '10981000.00', '0.00', 'شايبي عمر', 50, '2026-05-03', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(13, 13, 1, NULL, '3962000.00', '3962000.00', '0.00', 'دحية الحسين', 90, NULL, '0.00', 8, 3, 1, 2, 2, 'رفض الملف من طرف الرقابة المالية لعدم وجود شهادة التسجيل', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(14, 14, 1, NULL, '11930000.00', '11930000.00', '0.00', 'دحيري مصطفى', 90, '2026-05-03', '80.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(15, 15, 1, NULL, '7202000.00', '7202000.00', '0.00', 'دحيري مصطفى', 105, '2026-04-13', '80.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(16, 16, 1, NULL, '7374000.00', '7374000.00', '7373525.60', 'سليماني عبد القادر', 90, '2026-04-13', '100.00', 8, 3, 1, NULL, 6, 'ملف  الغلق  لدى امين الخزينة', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(17, 17, 1, NULL, '5072000.00', '5072000.00', '0.00', 'بسيطة بوضياف', 88, '2026-04-13', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية (توقف الاشغال يوم 21-04-2026  اصدار امر بالاستاناف يوم 07-07-2026)', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(18, 18, 1, NULL, '5705000.00', '5705000.00', '0.00', 'دحيري مصطفى', 45, '2026-04-13', '35.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(19, 19, 1, NULL, '1689000.00', '1689000.00', '0.00', 'بسيطة بوضياف', 60, '2026-04-13', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية (توقف الاشغال يوم 21-04-2026  اصدار امر بالاستاناف يوم 07-07-2026)', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(20, 20, 1, NULL, '9896000.00', '9896000.00', '0.00', 'خيرواني للبناء', 105, '2026-04-13', '85.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(21, 21, 1, NULL, '8500000.00', '7221000.00', '0.00', 'سعد المال وليد رشيد', 90, NULL, '0.00', 8, 3, 1, NULL, 4, 'ايداع ملف التسجيل بعد اعادة الاجراءات', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(22, 22, 1, NULL, '8500000.00', '4541000.00', '0.00', 'عبيدة رابح', 90, '2026-04-06', '100.00', 8, 3, 1, NULL, 6, 'ملف تسوية المالية و الغلق  لدى امين الخزينة', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(23, 23, 1, NULL, '4702000.00', '3779000.00', '0.00', 'خضراوي عائشة', 35, '2026-04-06', '100.00', 8, 3, 1, NULL, 6, 'ملف تسوية المالية و الغلق  لدى امين الخزينة', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(24, 24, 1, NULL, '21037000.00', '23917000.00', '0.00', 'بسيطة السعيد', 88, '2026-07-07', '5.00', 8, 1, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(25, 25, 1, NULL, '11718000.00', '11718000.00', '11717811.00', 'خيذري هشام', 60, '2026-03-30', '100.00', 8, 3, 1, NULL, 7, 'مغلقة بتاريخ 18-06-2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(26, 26, 1, NULL, '5000000.00', '5588000.00', '0.00', 'حبيشي عامر', 150, '2026-04-28', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية - في انتظار المصادقة على المخططات من طرف CTC', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(27, 27, 1, NULL, '5000000.00', '4768000.00', '0.00', 'حبيشي عامر', 150, '2026-04-28', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية - في انتظار المصادقة على المخططات من طرف CTC', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(28, 28, 1, NULL, '4000000.00', '3857000.00', '0.00', 'مناد عبد الرزاق', 180, '2026-04-28', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية - في انتظار المصادقة على المخططات من طرف CTC', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(29, 29, 1, NULL, '4000000.00', '3892000.00', '0.00', 'مناد عبد الرزاق', 180, '2026-04-28', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية - في انتظار المصادقة على المخططات من طرف CTC', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(30, 30, 1, NULL, '34843000.00', '31616000.00', '0.00', 'سلمان لحسن', 180, '2026-07-19', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(31, 31, 1, '', '4718000.00', '4718000.00', '0.00', 'زيد الخير خالد', 60, '2026-03-31', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 20:08:37', 1, 2),
(32, 32, 1, '', '6679000.00', '6679000.00', '6114791.00', 'سعد المال وليد رشيد', 90, '2026-03-31', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 09/07/2026', '2026-07-23 20:43:01', '2026-07-26 20:07:49', 1, 1),
(33, 33, 1, NULL, '16201000.00', '16201000.00', '0.00', 'صابر اياد', 90, '2026-03-31', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(34, 34, 1, '', '10702000.00', '10702000.00', '10502226.00', 'ش ذ م م او او ار  بي اش بي', 60, '2026-03-31', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 04/05/2026', '2026-07-23 20:43:01', '2026-07-26 20:07:55', 1, 2),
(35, 35, 1, NULL, '0.00', '11383000.00', '0.00', 'دحية علي', 60, NULL, '0.00', 8, 3, 1, 1, 2, 'تم التسجيل بتاريخ 13-07-2026\r\n(عملية اضافية)', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(36, 36, 1, NULL, '30000000.00', '27520000.00', '0.00', 'رميثة ليلى', 90, '2026-04-26', '30.00', 8, 1, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(37, 37, 1, NULL, '5293000.00', '5293000.00', '0.00', 'بن البار عيسى', 75, '2026-04-12', '98.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(38, 38, 1, NULL, '17206000.00', '17206000.00', '17042763.50', 'طويري سليمان', 65, '2026-04-12', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 18/06/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(39, 39, 1, NULL, '14703000.00', '14703000.00', '0.00', 'جرارة كمال', 90, NULL, '0.00', 8, 3, 1, 2, 2, 'على مستوى الرقابة المالية وجود مشكلة التسجيل العقاري', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(40, 40, 1, NULL, '22200000.00', '21969000.00', '0.00', NULL, NULL, NULL, '0.00', 8, 3, 1, 1, 2, 'تم التسجيل بتاريخ 13-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(41, 41, 1, NULL, '22502000.00', '22502000.00', '0.00', 'بسيطة سعيد', 90, '2026-04-07', '67.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(42, 42, 1, NULL, '33784000.00', '33784000.00', '0.00', 'بن اعمر فضيلة', 120, '2026-04-07', '38.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(43, 43, 1, NULL, '23641000.00', '23641000.00', '0.00', 'بن اعمر فضيلة', 120, '2026-04-07', '40.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(44, 44, 1, NULL, '8700000.00', '8682000.00', '0.00', 'بن اعمر فضيلة', 90, '2026-04-22', '100.00', 8, 1, 1, NULL, 6, 'التسوية المالية والغلق', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(45, 45, 1, NULL, '26247000.00', '26247000.00', '0.00', 'صيد عبد الله', 90, '2026-04-23', '30.00', 8, 3, 1, NULL, 4, 'نتائج الحفر سلبية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(46, 46, 1, NULL, '18700000.00', '16235000.00', '0.00', 'بن اعمر فضيلة', 90, '2026-06-21', '30.00', 8, 1, 1, NULL, 3, 'الاشغال جارية تم توجيه اعذار كتابي للمقاول يوم 30/06/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(47, 47, 1, NULL, '11963000.00', '11963000.00', '11962951.00', 'بن فرحات كمال', 60, '2026-03-29', '100.00', 8, 3, 1, NULL, 7, 'مغلقة بتاريخ 11/05/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(48, 48, 1, NULL, '9986000.00', '9986000.00', '9985849.30', 'ش ذ م م  عباسي', 60, '2026-03-29', '100.00', 8, 3, 1, NULL, 7, 'مغلقة بتاريخ 14/05/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(49, 49, 1, NULL, '11932000.00', '11932000.00', '0.00', 'بن اعمر فضيلة', 120, '2026-03-29', '25.00', 8, 3, 1, NULL, 3, 'الأشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(50, 50, 1, NULL, '9985000.00', '9985000.00', '9984593.85', 'بودور عبد الجبار', 60, '2026-03-29', '100.00', 8, 3, 1, NULL, 7, 'مغلقة بتاريخ 14/05/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(51, 51, 1, NULL, '18265000.00', '18265000.00', '0.00', 'بن اعمر فضيلة', 120, '2026-03-29', '25.00', 8, 3, 1, NULL, 3, 'الأشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(52, 52, 1, NULL, '4000000.00', '3964000.00', '3963295.00', 'بن فرحات كمال', 60, '2026-04-06', '100.00', 8, 1, 1, NULL, 7, 'مغلقة بتاريخ 4-06-2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(53, 53, 1, NULL, '17994000.00', '17994000.00', '0.00', 'لمونس النوي', 135, NULL, '0.00', 8, 3, 1, NULL, 2, 'تم التكفل في انتظار ODS - تم ايداع الاعذار بالجرائد لعدم استلام المقاولة للامر بالخدمةيوم 01/07/2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(54, 54, 1, NULL, '8197000.00', '8197000.00', '8100925.00', 'بسيطة بوضياف', 30, '2026-04-15', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 20/07/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(55, 55, 1, NULL, '12000000.00', '11890000.00', '0.00', 'قادري محمد', 150, '2026-04-14', '20.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(56, 56, 1, NULL, '9902000.00', '9902000.00', '0.00', 'بديرينة محمد', 60, '2026-04-13', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(57, 57, 1, NULL, '28000000.00', '28000000.00', '18692758.00', 'مؤسسة اشغال الري', 75, '2026-04-16', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(58, 58, 1, NULL, '2948000.00', '2948000.00', '2947630.00', 'مؤسسة اشغال الري', 30, '2026-04-16', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 23/06/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(59, 59, 1, NULL, '12000000.00', '11973000.00', '0.00', 'فراحتية الميلود', 135, '2026-04-29', '20.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(60, 60, 1, NULL, '12000000.00', '11890000.00', '0.00', 'رحمون علي', 150, '2026-04-29', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(61, 61, 1, NULL, '4000000.00', '3999000.00', '3998995.00', 'جنيدي محمد', 20, '2026-04-14', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 12/07/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(62, 62, 1, NULL, '0.00', '15000000.00', '0.00', 'مجمع الحضنة', 45, NULL, '0.00', 8, 3, 1, 1, 2, 'تم التسجيل يوم 13/07/2026\r\n(عملية اضافية)', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(63, 63, 1, NULL, '5176000.00', '5176000.00', '0.00', 'خليف عادل', 60, '2026-04-21', '20.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(64, 64, 1, NULL, '20772000.00', '20772000.00', '0.00', 'بري رضا', 120, '2026-05-04', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(65, 65, 1, NULL, '10623000.00', '10623000.00', '0.00', 'الاصيل للاشغال', 90, '2026-05-04', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(66, 66, 1, NULL, '9997000.00', '9997000.00', '0.00', 'بعلي عبد الرزاق', 60, '2026-04-21', '35.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(67, 67, 1, NULL, '14993000.00', '14993000.00', '0.00', 'م ذ ش و ذ م م نوح المسك', 90, '2026-05-04', '15.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(68, 68, 1, NULL, '15582000.00', '15582000.00', '0.00', 'م ش ذ و  م م ال ال', 90, '2026-05-04', '50.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(69, 69, 1, NULL, '20000000.00', '20230000.00', '0.00', 'قوود وورك سرفيس', 90, NULL, '0.00', 8, 1, 1, NULL, 4, 'اعادة الاجراءات بعد الفسخ', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(70, 70, 1, NULL, '17500000.00', '17500000.00', '0.00', 'صدارة عادل', 90, '2026-05-04', '20.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(71, 71, 1, NULL, '8000000.00', '7499000.00', '0.00', 'شوادر سمير', 60, '2026-07-06', '60.00', 8, 1, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(72, 72, 1, NULL, '6000000.00', '6000000.00', '0.00', 'الاصيل للاشغال', 90, '2026-05-06', '5.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(73, 73, 1, NULL, '5680000.00', '5680000.00', '0.00', 'الاصيل للاشغال', 90, '2026-05-06', '50.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(74, 74, 1, NULL, '6634000.00', '6634000.00', '0.00', 'الاصيل للاشغال', 60, '2026-04-08', '20.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(75, 75, 1, NULL, '2469000.00', '2469000.00', '0.00', 'الاصيل للاشغال', 20, '2026-04-08', '30.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(76, 76, 1, NULL, '17000000.00', '16996000.00', '0.00', 'عياش حمودة', 120, '2026-04-16', '40.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(77, 77, 1, NULL, '9997000.00', '9997000.00', '7134790.51', 'بعلي عبد الرزاق', 90, '2026-04-08', '80.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(78, 78, 1, NULL, '18810000.00', '18810000.00', '0.00', 'مؤسسة زهرة للاشغال', 90, '2026-04-16', '60.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(79, 79, 1, NULL, '14000000.00', '13989000.00', '0.00', 'بن قادة بلخير', 85, '2026-06-14', '85.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(80, 80, 1, NULL, '9000000.00', '8978000.00', '0.00', 'بن قادة بلخير', 85, '2026-06-14', '89.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(81, 81, 1, NULL, '12000000.00', '11997000.00', '0.00', 'بن قادة بلخير', 120, NULL, '0.00', 8, 3, 1, 2, 2, 'تم تأشير لجنة الصفقات بتاريخ 19-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(82, 82, 1, NULL, '8000000.00', '8000000.00', '7993775.00', 'خيذري ميلتي سرفيس', 45, '2026-04-19', '100.00', 8, 3, 1, NULL, 6, 'في طور الغلق', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(83, 83, 1, NULL, '12200000.00', '12198000.00', '0.00', 'بن قادة بلخير', 120, NULL, '0.00', 8, 3, 1, 2, 2, 'تم تأشير لجنة الصفقات بتاريخ 19-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(84, 84, 1, NULL, '52720100.00', '52719000.00', '0.00', 'بن قادة بلخير', 150, NULL, '0.00', 8, 1, 1, 2, 2, 'تم تأشير لجنة الصفقات بتاريخ 19-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(85, 85, 1, NULL, '39800000.00', '39788000.00', '0.00', 'بن قادة بلخير', 150, '2026-06-11', '6.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(86, 86, 1, NULL, '13000000.00', '12979000.00', '0.00', 'بن قادة بلخير', 55, '2026-06-11', '30.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(87, 87, 1, NULL, '8000000.00', '7993000.00', '0.00', 'الاء تسنيم', 88, '2026-05-13', '100.00', 8, 3, 1, NULL, 6, 'التسوية المالية والغلق', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(88, 88, 1, NULL, '9000000.00', '8965000.00', '8964270.00', 'الاء تسنيم', 55, '2026-04-23', '100.00', 8, 3, 1, NULL, 6, 'التسوية المالية والغلق', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(89, 89, 1, NULL, '25952000.00', '25945000.00', '0.00', 'بن قادة بلخير', 60, '2026-06-24', '25.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(90, 90, 1, NULL, '50000000.00', '39263000.00', '0.00', 'صابر اياد', 90, '2026-06-02', '70.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(91, 91, 1, NULL, '60000000.00', '59846000.00', '0.00', 'طيبي محمد', 150, '2026-05-17', '5.00', 8, 1, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(92, 92, 1, NULL, '18000000.00', '15151000.00', '0.00', 'بنيرة رزيق', 120, NULL, '0.00', 8, 3, 1, 1, 2, 'تم تسجيل المقرر التعديلي يوم 24/06/2026 -اجتماع لجنة الصفقات بتاريخ 20-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(93, 93, 1, NULL, '13000000.00', '12657000.00', '0.00', 'جبل ثامر للمقاولات', 120, NULL, '0.00', 8, 3, 1, 1, 2, 'تم تسجيل المقرر التعديلي يوم 24/06/2026 -اجتماع لجنة الصفقات بتاريخ 20-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(94, 94, 1, NULL, '20000000.00', '18064000.00', '0.00', 'جبل ثامر للمقاولات', 120, NULL, '0.00', 8, 3, 1, 1, 2, 'تم تسجيل المقرر التعديلي يوم 24/06/2026  -اجتماع لجنة الصفقات بتاريخ 20-07-2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(95, 95, 1, NULL, '6495000.00', '6495000.00', '6494841.50', 'صيد عبد الله', 60, '2026-04-01', '100.00', 8, 3, 1, NULL, 7, 'تم الغلق يوم 10/06/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(96, 96, 1, NULL, '4993000.00', '4993000.00', '0.00', 'صيد عبد الله', 60, '2026-04-01', '100.00', 8, 3, 1, NULL, 6, 'ملف تسوية المالية و الغلق  لدى امين الخزينة', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(97, 97, 1, NULL, '10000000.00', '10000000.00', '0.00', 'دحيري مصطفى', 60, '2026-04-01', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(98, 98, 1, NULL, '10981000.00', '10981000.00', '0.00', 'دحيري مصطفى', 85, '2026-04-05', '85.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(99, 99, 1, '', '2481000.00', '2481000.00', '0.00', 'جغلاف عبد الله', 68, '2026-04-05', '90.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(100, 100, 1, NULL, '24889000.00', '24889000.00', '0.00', 'طيبي محمد', 88, '2026-04-28', '95.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(101, 101, 1, NULL, '22402000.00', '22402000.00', '0.00', 'بومدوحة محمد لمين', 180, '2026-05-08', '35.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(102, 102, 1, NULL, '22000000.00', '20814000.00', '0.00', 'وزاني اسماعيل', 210, NULL, '0.00', 8, 3, 1, 2, 2, 'تم تأشير من طرف المراقب الميزانياتي يوم 15/07/2026في انتظار ods', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(103, 103, 1, NULL, '26000000.00', '19314000.00', '0.00', 'عبدو جمال الدين', 108, NULL, '0.00', 8, 3, 1, 1, 2, 'تم التسجيل يوم 19/04/2026 - تم التداول على فتح الاعتماد المالي 07/06/2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(104, 104, 1, NULL, '3209000.00', '3209000.00', '0.00', 'دحيري عبد الصمد', 50, NULL, '0.00', 8, 3, 1, 2, 2, 'في انتظار التأشير من طرف المراقب المالي بعد رفع التحفضات خلال هذا الاسبوع', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(105, 105, 1, NULL, '3388000.00', '3388000.00', '0.00', 'دحيري عبد الصمد', 50, NULL, '0.00', 8, 3, 1, 2, 2, 'في انتظار التأشير من طرف المراقب المالي بعد رفع التحفضات خلال هذا الاسبوع', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(106, 106, 1, NULL, '15790000.00', '15790000.00', '0.00', 'مؤسسة جدي', 150, NULL, '0.00', 8, 3, 1, NULL, 2, 'تم الالتزام من طرف الرقابة المالية يوم 08/06/2026 في انتظار ods', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(107, 107, 1, '', '22972900.00', '22972900.00', '0.00', NULL, NULL, NULL, '0.00', 1, 1, 2, NULL, 1, 'تمت المصادقة على دفتر الشروط بتاريخ :20/07/2026', '2026-07-23 20:43:01', '2026-07-24 09:19:35', 1, NULL),
(108, 108, 1, NULL, '12000000.00', '12652000.00', '0.00', 'محدب خالد', 120, '2026-07-19', '5.00', 8, 3, 1, NULL, 3, 'تم اعطاء اشارة الانطلاق بتاريخ :19/07/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(109, 109, 1, NULL, '9431000.00', '9431000.00', '0.00', 'عبد المجيد علي', 57, '2026-05-11', '100.00', 8, 3, 1, NULL, 6, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(110, 110, 1, NULL, '7969000.00', '7969000.00', '0.00', 'سليماني عبد القادر', 60, '2026-05-11', '90.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(111, 111, 1, NULL, '12290000.00', '12290000.00', '0.00', 'بيترو بار تونار', 210, '2026-06-14', '10.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(112, 112, 1, NULL, '10000000.00', '10238000.00', '0.00', 'محدب خالد', 120, '2026-07-19', '5.00', 8, 3, 1, 2, 3, 'تم اعطاء اشارة الانطلاق بتاريخ :19/07/2026', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(113, 113, 1, NULL, '5757000.00', '5757000.00', '0.00', 'سليماني عبد القادر', 60, '2026-05-11', '65.00', 8, 3, 1, NULL, 3, 'الاشغال جارية', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(114, 114, 1, NULL, '45000000.00', '37038000.00', '0.00', 'والي حكيم', 120, '2026-07-19', '0.00', 8, 1, 1, 2, 2, 'تم اعطاء اشارة الانطلاق بتاريخ :19/07/2026', '2026-07-23 20:43:01', '2026-07-23 20:51:24', 1, NULL),
(115, 115, 1, NULL, '2547000.00', '2547000.00', '0.00', 'محمد عبد اللاوي', 54, '2026-05-11', '100.00', 8, 3, 1, NULL, 6, 'التسوية المالية والغلق', '2026-07-23 20:43:01', '2026-07-26 19:05:59', 1, NULL),
(116, 116, 1, 'حصة', '39941000.00', '39941000.00', '0.00', NULL, 12, '2026-04-13', '999.99', 8, 3, NULL, NULL, 3, 'الاشغال جارية', '2026-07-24 11:06:17', '2026-07-26 19:05:59', NULL, NULL),
(117, 117, 1, 'JJJJKKJ', '1.00', '1.00', '1.00', NULL, NULL, NULL, '0.00', 8, NULL, 1, NULL, 2, NULL, '2026-07-25 12:12:31', '2026-07-25 13:34:51', NULL, NULL),
(118, 119, 1, 'ررى', '1.00', '1.00', '1.00', NULL, NULL, NULL, '0.00', 4, NULL, 1, NULL, 1, NULL, '2026-07-25 12:16:17', '2026-07-25 13:34:45', NULL, NULL),
(119, 120, 1, 'نن', '111.00', '111.00', '1.00', NULL, NULL, NULL, '0.00', 8, NULL, 1, NULL, 4, NULL, '2026-07-25 12:24:50', '2026-07-25 13:35:02', NULL, NULL),
(120, 120, 2, 'kjjjjjjjjjjjjjjjjjjjjjj', '11111.00', '1111.00', '111.00', NULL, NULL, NULL, '0.00', 8, NULL, 1, NULL, 4, NULL, '2026-07-25 12:24:50', '2026-07-25 16:32:21', NULL, NULL),
(121, 120, 3, 'ننننننننننننن', '11.00', '11.00', '11.00', NULL, NULL, NULL, '0.00', 8, NULL, 1, NULL, 4, NULL, '2026-07-25 12:24:50', '2026-07-25 13:34:54', NULL, NULL),
(122, 121, 1, 'k', '0.00', '0.00', '0.00', NULL, NULL, NULL, '0.00', NULL, NULL, NULL, NULL, NULL, NULL, '2026-07-25 15:38:25', '2026-07-25 15:38:25', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `programs`
--

CREATE TABLE `programs` (
  `id` int(11) NOT NULL,
  `Type` varchar(20) NOT NULL DEFAULT 'ADSEC',
  `Year` int(11) NOT NULL DEFAULT 0,
  `name` varchar(50) NOT NULL,
  `IsClosed` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `programs`
--

INSERT INTO `programs` (`id`, `Type`, `Year`, `name`, `IsClosed`) VALUES
(1, 'ADSEC', 2025, 'ADSEC2025', 1),
(2, 'ADSEC', 2026, 'ADSEC2026', 0),
(4, 'CGSCL', 2025, 'CGSCL2025', 0);

-- --------------------------------------------------------

--
-- Table structure for table `projects`
--

CREATE TABLE `projects` (
  `id` int(11) NOT NULL,
  `operation_number` varchar(100) NOT NULL,
  `operation_name` text NOT NULL,
  `program_id` int(11) NOT NULL,
  `daira_id` int(11) NOT NULL,
  `commune_id` int(11) NOT NULL,
  `domain_id` int(11) NOT NULL,
  `sector_id` int(11) NOT NULL,
  `has_lots` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `updated_by` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `projects`
--

INSERT INTO `projects` (`id`, `operation_number`, `operation_name`, `program_id`, `daira_id`, `commune_id`, `domain_id`, `sector_id`, `has_lots`, `created_at`, `updated_at`, `updated_by`) VALUES
(1, 'ADSEC2026-001', 'تهيئة حضرية بحي محمد شعباني', 2, 1, 1, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(2, 'ADSEC2026-002', 'تجديد شبكة الصرف الصحي بحي محمد شعباني', 2, 1, 1, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(3, 'ADSEC2026-003', 'توسيع شبكة المياه الصالحة للشرب بحي محمد شعباني', 2, 1, 1, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(4, 'ADSEC2026-004', 'انجاز  ساحة لعب بالعشب الإصطناعي بحي الكادات', 2, 1, 1, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(5, 'ADSEC2026-005', 'تهيئة حضرية بحي سيدي سليمان', 2, 1, 1, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(6, 'ADSEC2026-006', 'تهيئة حضرية بقرية المعذر', 2, 1, 1, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(7, 'ADSEC2026-007', 'صيانة الطريق البلدي رقم 01 مابين ن ك 0 الى ن ك 07 على مسافة 03   كم', 2, 1, 1, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(8, 'ADSEC2026-008', 'انجاز انارة عمومية نوع لاد عبر احياء المدينة', 2, 1, 1, 6, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(9, 'ADSEC2026-009', 'تهيئة حضرية على امتداد شارع جيش التحرير الطريق الرئيسي ومن المقبرة الى شارع مزوزي الخذير وشارع الثورة حي مفدي زكرياء', 2, 1, 3, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(10, 'ADSEC2026-010', 'تهيئة حضرية بشارع لطرش احمد', 2, 1, 3, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(11, 'ADSEC2026-011', 'تهيئة حضرية بحي العائدين', 2, 1, 3, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(12, 'ADSEC2026-012', 'توسيع شبكة الانارة العمومية عبر احياء المدينة', 2, 1, 3, 6, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(13, 'ADSEC2026-013', 'ترميم قاعة علاج  بحي راس العين', 2, 1, 3, 7, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(14, 'ADSEC2026-014', 'تجديد و توسيع شبكة الصرف الصحي عبر احياء - عبد الحميد مهري -  الامير عبد القادر -  العائدين -  يوسف زيغود', 2, 1, 3, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(15, 'ADSEC2026-015', 'تجديد و توسيع شبكة الصرف الصحي بالعليق', 2, 1, 2, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(16, 'ADSEC2026-016', 'تجديد و توسيع شبكة الصرف الصحي بولتام المركزي', 2, 1, 2, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(17, 'ADSEC2026-017', 'تجديد و توسيع شبكة المياه الصالحة للشرب بالعليق', 2, 1, 2, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(18, 'ADSEC2026-018', 'تجديد و توسيع شبكة المياه الصالحة للشرب بولتام المركزي', 2, 1, 2, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(19, 'ADSEC2026-019', 'تجديد و توسيع شبكة المياه الصالحة للشرب بعون الله', 2, 1, 2, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(20, 'ADSEC2026-020', 'تهيئة حضرية بحي القصر العتيق العليق', 2, 1, 2, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(21, 'ADSEC2026-021', 'تجديد شبكة التطهير بحي الدشرة و المصالحة', 2, 5, 15, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(22, 'ADSEC2026-022', 'تجديد شبكة توزيع المياه الصالحة للشرب بالمنظر الجميل وجنان الكاف والمصالحة و 101 قطعة', 2, 5, 15, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(23, 'ADSEC2026-023', 'انجاز شبكة توزيع المياه الصالحة للشرب بالواد الميت لعويشات', 2, 5, 15, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(24, 'ADSEC2026-024', 'صيانة الطريق البلدي رقم 05 الرابط بين الطريق الوطني رقم 08 والديس من ن ك 2400 الى ن ك 2420', 2, 5, 15, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(25, 'ADSEC2026-025', 'انجاز ساحة لعب بالعشب الاصطناعي بعين الديس  - بلدية اولاد سيدي ابراهيم', 2, 5, 15, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(26, 'ADSEC2026-026', 'بناء قاعة تدريس للمدرسة الابتدائية حميدي السعيد بحي الواد الابيض', 2, 5, 15, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(27, 'ADSEC2026-027', 'بناء قاعة تدريس للمدرسة الابتدائية عمر بن الخطاب بحي البتة', 2, 5, 15, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(28, 'ADSEC2026-028', 'بناء قاعة للتدريس بالمدرسة الابتدائية المصالحة', 2, 5, 15, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(29, 'ADSEC2026-029', 'بناء قاعة للتدريس بالمدرسة الابتدائية ابوبكر الصديق', 2, 5, 15, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(30, 'ADSEC2026-030', 'انجاز  بئر  على مستوى التجمع السكاني بئر الصديق مع الربط بالكهرباء', 2, 5, 15, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(31, 'ADSEC2026-031', 'توسيع شبكة المياه الصالحة للشرب بحي عين سحنون ، عين خرمام وذراع الطين', 2, 5, 16, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(32, 'ADSEC2026-032', 'توسيع شبكة التطهير بسد خرمام طواهرية و ذراع الطين', 2, 5, 16, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(33, 'ADSEC2026-033', 'انجاز مصب الصرف الصحي  المراحات 02', 2, 5, 16, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(34, 'ADSEC2026-034', 'انجاز  طريق يربط المقبرة بالطريق الوطني رقم 08 بعين خرمام  على مسافة 800 م', 2, 5, 16, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(35, 'ADSEC2026-035', 'انجاز ساحة لعب بالعشب الاصطناعي ببنزوه مركز', 2, 5, 16, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(36, 'ADSEC2026-036', 'صيانة الطريق البلدي  رقم 02 الرابط بين منطقة السارق والطريق الوطني رقم 46 الشطر الثاني على مسافة 3 كلم', 2, 3, 9, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(37, 'ADSEC2026-037', 'توسيع شبكة المياه الصالحة للشرب  بحي 80 مسكن وطريق مسيف', 2, 3, 9, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(38, 'ADSEC2026-038', 'تجديد وتوسيع شبكة التطهير بأحياء المستشفى-الميكانيك-الأطلس-الميته  ببلدية بن سرور', 2, 3, 9, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(39, 'ADSEC2026-039', 'إعادة تهيئة مدرسة زريط سعد ببن سرور', 2, 3, 9, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(40, 'ADSEC2026-040', 'صيانة الطريق البلدي رقم 06 الرابط بين منطقة عين سي عمر والطريق الوطني رقم 70 على مسافة 01 كم', 2, 3, 9, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(41, 'ADSEC2026-041', 'تهيئة حضرية  (طرق + أرصفة) بشارع مسعودي أحمد بن علي بحي القرية', 2, 3, 11, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(42, 'ADSEC2026-042', 'تهيئة حضرية   (طرق + أرصفة) عبر الشوارع الرابطة بين شارع الزيقم عبد المجيد الحفناوي والطريق الوطني 70', 2, 3, 11, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(43, 'ADSEC2026-043', 'تهيئة حضرية  (طرق + أرصفة)  بشارع طويري عبد الحميد بن بوسعيد', 2, 3, 11, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(44, 'ADSEC2026-044', 'صيانة الطريق البلدي رقم 01 الرابط بين الطريق الوطني رقم 70 ومنطقة بوملال على مسافة 0.2 كلم', 2, 3, 11, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(45, 'ADSEC2026-045', 'انجاز بئر لتزويد مدينة اولاد سليمان بالمياه الصالحة للشرب', 2, 3, 10, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(46, 'ADSEC2026-046', 'صيانة الطريق البلدي رقم 06 الرابط بين منطقة الشترة-الدهلاس ومدينة أولاد سليمان الشطر الثاني على مسافة 2 كلم', 2, 3, 10, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(47, 'ADSEC2026-047', 'انجاز شبكة  المياه الصالحة للشرب بمنطقة الخربة', 2, 3, 12, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(48, 'ADSEC2026-048', 'توسيع شبكة الإنارة العمومية للمدخل الشمالي والجنوبي - بلدية الزرزور', 2, 3, 12, 6, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(49, 'ADSEC2026-049', 'انجاز مسلك مدعم يربط منطقة المسدور بالطريق البلدي لحبارة على مسافة 3 كلم', 2, 3, 12, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(50, 'ADSEC2026-050', 'تهيئة حضرية   (طرق + أرصفة) بجانب الملعب البلدي الزرزور مركز', 2, 3, 12, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(51, 'ADSEC2026-051', 'تعبيد الطريق الرابط بين منطقة أم العجول ومدينة الزرزور الشطر الاول على مسافة 2 كلم', 2, 3, 12, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(52, 'ADSEC2026-052', 'صيانة الطريق البلدي رقم 06 الرابط بين الطريق الوطني رقم 70 ومنطقة الدخان على مسافة 0.1 كلم ( عند معبر واد الزفزاف)', 2, 3, 12, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(53, 'ADSEC2026-053', 'انجاز بئر لتموين تجمع السمارة بالمياه الصالحة للشرب', 2, 6, 17, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(54, 'ADSEC2026-054', 'ربط بئر العقلة البيضاء بقناة الجلب لمدينة جبل امساعد', 2, 6, 17, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(55, 'ADSEC2026-055', 'بناء قاعة علاج بمنطقة المقسم الابيض', 2, 6, 17, 7, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(56, 'ADSEC2026-056', 'تجديد وتوسيع شبكة الصرف الصحي عبر احياء (غزالي المختار – بكراوي علي – اعمارة محمد – لزرق احمد – لسلت زيان – احميدي عبد القادر – بن رية احمد – طيبي علي )', 2, 6, 17, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(57, 'ADSEC2026-057', 'تجديد وتوسيع شبكة الصرف الصحي  ببلدية سليم لاحياء (عز الدين محمد،جقبوب احمد،براهم سعد،بوزيدي علي ،لقراب محمد )', 2, 6, 18, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(58, 'ADSEC2026-058', 'تجديد وتوسيع شبكة الصرف الصحي بعين مقارنز -الشطر 02-', 2, 6, 18, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(59, 'ADSEC2026-059', 'بناء  03 قاعات تدريس + مطعم مدرسي نمط 100 وجبة بحي الفرشة بلدية سليم: بناء  03 قاعات تدريس', 2, 6, 18, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(60, 'ADSEC2026-060', 'بناء  03 قاعات تدريس + مطعم مدرسي نمط 100 وجبة بحي الفرشة بلدية سليم: بناء مطعم مدرسي نمط 100 وجبة', 2, 6, 18, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(61, 'ADSEC2026-061', 'تجديد المعدات للمدارس الابتدائية لبلدية سليم', 2, 6, 18, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(62, 'ADSEC2026-062', 'تهيئة حضرية لحي جقبوب بلقاسم', 2, 6, 18, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(63, 'ADSEC2026-063', 'تهيئة ساحة ببلدية الخبانة', 2, 7, 23, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(64, 'ADSEC2026-064', 'تعبيد الطرق البلدية على مسافة 04 كلم (طريق العرف على مسافة  800م - طريق معذر الدفلة على مسافة 2 كم   - طريق المرقب على مسافة1,2 كم )', 2, 7, 23, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(65, 'ADSEC2026-065', 'توسيع شبكة الصرف الصحي ببلدية الخبانة', 2, 7, 23, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(66, 'ADSEC2026-066', 'تهيئة حضرية بقرية واد سيدي اسعيد', 2, 7, 23, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(67, 'ADSEC2026-067', 'تهيئة حضرية حي بلواضح حسان ( أرصفة )', 2, 7, 23, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(68, 'ADSEC2026-068', 'تهيئة حضرية ( أرصفة ) حي بلواضح الطيب / لخضر', 2, 7, 23, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(69, 'ADSEC2026-069', 'صيانة الطريق البلدي رقم 06: صيانة الطريق الرابط بين طريق لمريق ومعيزة على مسافة 03 كلم', 2, 7, 20, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(70, 'ADSEC2026-070', 'إنجاز 03 قاعات تدريس لمدرسة شرابة علي بحي 100 مسكن اجتماعي', 2, 7, 20, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(71, 'ADSEC2026-071', 'صيانة الطريق البلدي رقم 01: صيانة ممر  واد العباسية', 2, 7, 20, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(72, 'ADSEC2026-072', 'تجديد وتوسيع شبكة الصرف الصحي بالتجمع الرئيسي الرمانة', 2, 7, 20, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(73, 'ADSEC2026-073', 'تجديد وتوسيع شبكة المياه الصالحة للشرب بالتجمع الرئيسي الرمانة', 2, 7, 20, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(74, 'ADSEC2026-074', 'توسيع شبكة الصرف الصحي ببلدية مسيف', 2, 7, 24, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(75, 'ADSEC2026-075', 'توسيع شبكة المياه الصالحة للشرب ببلدية مسيف', 2, 7, 24, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(76, 'ADSEC2026-076', 'بناء 04 أقسام توسعية لمدرسة المجاهد حسيني لخضر بمسيف', 2, 7, 24, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(77, 'ADSEC2026-077', 'تهيئة مدخلي ذراع يوسف ببلدية مسيف', 2, 7, 24, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(78, 'ADSEC2026-078', 'إنجــــــاز  طريق بمنطقة الغابة على مسافة 1,5 كلم', 2, 7, 24, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(79, 'ADSEC2026-079', 'انجاز خزان سعة 50 م3 مع الربط بمختلف الشبكات بالجهة الغربية لمنطقة اللويبدة', 2, 4, 13, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(80, 'ADSEC2026-080', 'تجديد وتوسيع شبكة الصرف الصحي بمنطقة اللويبدة', 2, 4, 13, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(81, 'ADSEC2026-081', 'انجاز ثلاثة 03 اقسام توسعة بمدرسة الشهيد يزير محمد بلدية امجدل', 2, 4, 13, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(82, 'ADSEC2026-082', 'توسعة شبكة الانارة العمومية من ثانوية المجاهد بن البار مسعود إلى غاية المفرغة العمومية', 2, 4, 13, 6, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(83, 'ADSEC2026-083', 'انجاز 03 قاعات للتدريس  بحي احمد زبانة بلدية امجدل', 2, 4, 13, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(84, 'ADSEC2026-084', 'صيانة الطريق البلدي رقم 01 الرابط بين المرازيق والكراكة على مسافة 05 كلم ( الشطر الثاني)', 2, 4, 13, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(85, 'ADSEC2026-085', 'انجاز 06 قاعات للتدريس + التدفئة المركزية + اعادة تهيئة بمدرسة الشهيد عزيز سليمان', 2, 4, 14, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(86, 'ADSEC2026-086', 'انجاز ساحة  مغطاة بالعشب الاصطناعي بالحي الجديد بلدية مناعة', 2, 4, 14, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(87, 'ADSEC2026-087', 'ربط  المدرسة الابتدائية الشهيد عزيز سليمان بشبكة الصرف الصحي بمسافة 400 م ط', 2, 4, 14, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(88, 'ADSEC2026-088', 'توسعة شبكة الانارة العمومية من الملعب البلدي إلى غاية المفرغة العمومية', 2, 4, 14, 6, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(89, 'ADSEC2026-089', 'صيانةالطريق الرابط بين الطريق الاجتنابي وبيت المكي على مسافة 2 كلم', 2, 4, 14, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(90, 'ADSEC2026-090', 'توسيع شبكة الصرف الصحي عبر احياء  البساتين و راس العين على مسافة 6700 متر  ( الشطر الاول 01  )', 2, 2, 4, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(91, 'ADSEC2026-091', 'صيانة الطريق البلدي رقم 01 الرابط بين الطريق الوطني رقم 89 الى غاية  البساتين على مسافة 05 كلم', 2, 2, 8, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(92, 'ADSEC2026-092', 'تهيئة حضرية بالتجمعات السكنية - ارصفة - :   برج بلخريف', 2, 2, 5, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(93, 'ADSEC2026-093', 'تهيئة حضرية بالتجمعات السكنية - ارصفة - :   القرية الفلاحية', 2, 2, 5, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(94, 'ADSEC2026-094', 'تهيئة حضرية بالتجمعات السكنية - ارصفة - :   عين سيدي امحمد', 2, 2, 5, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(95, 'ADSEC2026-095', 'تكملة توسعة شبكة المياه الصالحة للشرب بالبثعة مع ربطها بالخزان', 2, 2, 5, 3, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(96, 'ADSEC2026-096', 'انجاز شبكة الصرف الصحي بالتجمعات السكنية ببلدية سيدي امحمد', 2, 2, 5, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(97, 'ADSEC2026-097', 'انجاز ساحة لعب معشوشبة اصطناعيا بمنطقة الزريقات', 2, 2, 5, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(98, 'ADSEC2026-098', 'تجديد وتوسيع قنوات الصرف الصحي بعين فارس والخوان', 2, 2, 7, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(99, 'ADSEC2026-099', 'تهيئة وترميم قاعة العلاج بمنطقة أولاد عطية', 2, 2, 7, 7, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(100, 'ADSEC2026-100', 'تهيئة حضرية بالمقيطع -تزفيت-', 2, 2, 6, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(101, 'ADSEC2026-101', 'انجاز مكتب بريدي ببئر الفضة', 2, 2, 6, 9, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(102, 'ADSEC2026-102', 'إنجاز و تجهيز مطعم مدرسي نمط 200 وجبة بالمدرسة الابتدائية بوصيلة بن هني', 2, 8, 21, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(103, 'ADSEC2026-103', 'توسعة شبكة الصرف الصحي بحي دحماني سعيد', 2, 8, 21, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(104, 'ADSEC2026-104', 'اعادة تهيئة ساحة لعب  بمدرسة عاشور الحاج بمنطقة الخرزة وتغطيتها بالعشب الاصطناعي', 2, 8, 21, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(105, 'ADSEC2026-105', 'اعادة تهيئة ساحة لعب  بمدرسة زياد احمد وتغطيتها بالعشب الاصطناعي', 2, 8, 21, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(106, 'ADSEC2026-106', 'التهيئة الحضرية لمحيط المؤسسات التربوية  ( حديبي فرحات - بوصيلة بن هني- هواري احمد ) الشطر الأول', 2, 8, 21, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(107, 'ADSEC2026-107', 'صيانة الطريق البلدي رقم 04 الرابط بين الطريق الوطني رقم 89 ومنطقة الصفي على مسافة 06 كلم(الشطر الاول)', 2, 8, 21, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(108, 'ADSEC2026-108', 'التهيئة الحضرية: تهيئة الحديقة العمومية بن ناصر سالم بتامسة', 2, 8, 22, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(109, 'ADSEC2026-109', 'انجاز مسلك يربط مدينة تامسة بمنطقة مقطع بن رفان على مسافة 2.5 كلم', 2, 8, 22, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(110, 'ADSEC2026-110', 'تجديد وتوسعة شبكة الصرف الصحي بحي الوئام حي بن السايب ومنطقة معذر تامسة ( الشطر الاول)', 2, 8, 22, 2, 2, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(111, 'ADSEC2026-111', 'إنجاز مطعم مدرسي نمط 100 وجبة بالمدرسة الابتدائية المجاهد جفال علي بمنطقة الطويرف', 2, 8, 22, 8, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(112, 'ADSEC2026-112', 'التهيئة الحضرية: التهيئة الحضرية لمحيط ابتدائية الشهيد مصطفى بن بوالعيد تامسة', 2, 8, 22, 1, 1, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(113, 'ADSEC2026-113', 'انجاز فضاء لعب بمنطقة وجه زمرة', 2, 8, 22, 4, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(114, 'ADSEC2026-114', 'صيانة الطريق البلدي رقم 04 الرابط بين الطريق الولائي رقم 06 ومنطقة حرملة على مسافة 04 كم', 2, 8, 22, 5, 4, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(115, 'ADSEC2026-115', 'تهيئة  قاعة العلاج غزال رافع بمنطقة بئر ماجد', 2, 8, 22, 7, 3, 0, '2026-07-23 20:41:33', '2026-07-23 20:41:33', 1),
(116, 'OP-2026-001', 'تهيئة حضرية بعين فارس +عين العلق -تزفيت +ارصفة -', 2, 2, 7, 1, 4, 0, '2026-07-24 11:06:17', '2026-07-24 11:11:47', 1),
(117, '1', 'J', 1, 7, 23, 6, 4, 0, '2026-07-25 12:12:31', '2026-07-25 12:53:39', 1),
(119, '2', 'عا', 1, 7, 23, 9, 3, 0, '2026-07-25 12:16:17', '2026-07-25 13:29:21', 1),
(120, '3', 'نن', 1, 4, 14, 9, 1, 1, '2026-07-25 12:24:50', '2026-07-25 16:32:21', 1),
(121, '4', 'k', 1, 1, 3, 9, 3, 0, '2026-07-25 15:38:25', '2026-07-25 15:38:25', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `project_statuses`
--

CREATE TABLE `project_statuses` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `project_statuses`
--

INSERT INTO `project_statuses` (`id`, `name`) VALUES
(3, 'جارية'),
(1, 'غير مسجلة'),
(4, 'متوقفة'),
(6, 'مستلمة'),
(2, 'مسجلة'),
(7, 'مغلقة'),
(8, 'ملغاة'),
(5, 'منتهية');

-- --------------------------------------------------------

--
-- Table structure for table `sectors`
--

CREATE TABLE `sectors` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `sectors`
--

INSERT INTO `sectors` (`id`, `name`) VALUES
(4, 'الاشغال العمومية'),
(3, 'التجهيزات العمومية'),
(1, 'التعمير والبناء'),
(2, 'الموارد المائية');

-- --------------------------------------------------------

--
-- Table structure for table `special_status1`
--

CREATE TABLE `special_status1` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `special_status1`
--

INSERT INTO `special_status1` (`id`, `name`) VALUES
(3, 'دون'),
(2, 'غير مصنف'),
(1, 'مصنف');

-- --------------------------------------------------------

--
-- Table structure for table `special_status2`
--

CREATE TABLE `special_status2` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `special_status2`
--

INSERT INTO `special_status2` (`id`, `name`) VALUES
(1, 'للتسجيل'),
(2, 'للدراسة');

-- --------------------------------------------------------

--
-- Table structure for table `special_status3`
--

CREATE TABLE `special_status3` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `special_status3`
--

INSERT INTO `special_status3` (`id`, `name`) VALUES
(2, 'CF'),
(1, 'تداول');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `full_name` varchar(150) DEFAULT NULL,
  `role` enum('admin','manager','editor','viewer') DEFAULT 'viewer',
  `is_active` tinyint(1) DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password_hash`, `full_name`, `role`, `is_active`, `created_at`) VALUES
(1, 'admin', '123', 'System Administrator', 'admin', 1, '2026-06-04 12:41:18');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `administrative_procedures`
--
ALTER TABLE `administrative_procedures`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `communes`
--
ALTER TABLE `communes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `daira_id` (`daira_id`);

--
-- Indexes for table `dairas`
--
ALTER TABLE `dairas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `domains`
--
ALTER TABLE `domains`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `lots`
--
ALTER TABLE `lots`
  ADD PRIMARY KEY (`id`),
  ADD KEY `administrative_procedure_id` (`administrative_procedure_id`),
  ADD KEY `special_status1_id` (`special_status1_id`),
  ADD KEY `special_status2_id` (`special_status2_id`),
  ADD KEY `special_status3_id` (`special_status3_id`),
  ADD KEY `updated_by` (`updated_by`),
  ADD KEY `idx_lot_project` (`project_id`),
  ADD KEY `idx_lot_status` (`project_status_id`);

--
-- Indexes for table `programs`
--
ALTER TABLE `programs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`),
  ADD KEY `idx_type_year` (`Type`,`Year`);

--
-- Indexes for table `projects`
--
ALTER TABLE `projects`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `operation_number` (`operation_number`),
  ADD KEY `updated_by` (`updated_by`),
  ADD KEY `idx_project_program` (`program_id`),
  ADD KEY `idx_project_daira` (`daira_id`),
  ADD KEY `idx_project_commune` (`commune_id`),
  ADD KEY `idx_project_domain` (`domain_id`),
  ADD KEY `idx_project_sector` (`sector_id`);

--
-- Indexes for table `project_statuses`
--
ALTER TABLE `project_statuses`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `sectors`
--
ALTER TABLE `sectors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `special_status1`
--
ALTER TABLE `special_status1`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `special_status2`
--
ALTER TABLE `special_status2`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `special_status3`
--
ALTER TABLE `special_status3`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `administrative_procedures`
--
ALTER TABLE `administrative_procedures`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `communes`
--
ALTER TABLE `communes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `dairas`
--
ALTER TABLE `dairas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `domains`
--
ALTER TABLE `domains`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `lots`
--
ALTER TABLE `lots`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;

--
-- AUTO_INCREMENT for table `programs`
--
ALTER TABLE `programs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `projects`
--
ALTER TABLE `projects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=122;

--
-- AUTO_INCREMENT for table `project_statuses`
--
ALTER TABLE `project_statuses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `sectors`
--
ALTER TABLE `sectors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `special_status1`
--
ALTER TABLE `special_status1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `special_status2`
--
ALTER TABLE `special_status2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `special_status3`
--
ALTER TABLE `special_status3`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `communes`
--
ALTER TABLE `communes`
  ADD CONSTRAINT `communes_ibfk_1` FOREIGN KEY (`daira_id`) REFERENCES `dairas` (`id`);

--
-- Constraints for table `lots`
--
ALTER TABLE `lots`
  ADD CONSTRAINT `lots_ibfk_1` FOREIGN KEY (`project_id`) REFERENCES `projects` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `lots_ibfk_2` FOREIGN KEY (`administrative_procedure_id`) REFERENCES `administrative_procedures` (`id`),
  ADD CONSTRAINT `lots_ibfk_3` FOREIGN KEY (`special_status1_id`) REFERENCES `special_status1` (`id`),
  ADD CONSTRAINT `lots_ibfk_4` FOREIGN KEY (`special_status2_id`) REFERENCES `special_status2` (`id`),
  ADD CONSTRAINT `lots_ibfk_5` FOREIGN KEY (`special_status3_id`) REFERENCES `special_status3` (`id`),
  ADD CONSTRAINT `lots_ibfk_6` FOREIGN KEY (`project_status_id`) REFERENCES `project_statuses` (`id`),
  ADD CONSTRAINT `lots_ibfk_7` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);

--
-- Constraints for table `projects`
--
ALTER TABLE `projects`
  ADD CONSTRAINT `projects_ibfk_1` FOREIGN KEY (`program_id`) REFERENCES `programs` (`id`),
  ADD CONSTRAINT `projects_ibfk_2` FOREIGN KEY (`daira_id`) REFERENCES `dairas` (`id`),
  ADD CONSTRAINT `projects_ibfk_3` FOREIGN KEY (`commune_id`) REFERENCES `communes` (`id`),
  ADD CONSTRAINT `projects_ibfk_4` FOREIGN KEY (`domain_id`) REFERENCES `domains` (`id`),
  ADD CONSTRAINT `projects_ibfk_5` FOREIGN KEY (`sector_id`) REFERENCES `sectors` (`id`),
  ADD CONSTRAINT `projects_ibfk_6` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
